# -*- coding: utf-8 -*-

import random
import datetime
import locale
import csv
common_nigiri = ["鮮極鮭いくら","極上中とろ","まぐろ","びん長まぐろ",
                "とろかつお","サーモン","焼きサーモン","とろサーモン",
                "ノルウェーサーモン","鮮極生えび","えび","甘海老","合盛りえび",
                "赤えび","真いか","やりいか","こういか","いか軟骨","生たこ","たこ",
                "つぶ貝","ほっき貝","赤貝","黒みる貝","熟成かれい",
                "大葉のせえんがわ","煮穴子","〆いわし","とろ〆さば","大あじ","玉子","いなり",
                "合盛り玉子いなり","わさびなす","うなぎ"]

aburi_tenpura = ["極上中とろ直火炙り","ノルウェーサーモン直火炙り","とろサーモン直火炙り","サーモンチーズマヨ直火炙り",
                "赤えび塩直火炙り","いか軟骨マヨ直火炙り","玉子チーズマヨ直火炙り","えびチーズマヨ直火炙り",
                "ほたて焦がし醤油直火炙り","とろ〆さば直火炙り","えび天にぎり","豪快いか天","えび天巻"]

gunkan_makimono = ["とろねぎ","山かけまぐろ","まぐろたたき","まぐたく","鮭とろっ軍艦","鱒いくら","うに","寿司屋のたたき",
            "海鮮うま辛和え","まぐろそぼろマヨ","いかおくら","なっとう軍艦","合盛りねばねば","かにみそ","甘海老軍艦","サラダ軍艦","コーン",
            "合盛りコーンとサラダ","ツナ","ぱっくり！半熟煮玉子軍艦","ししゃもっこ","かっぱ巻","鉄火巻","干ぴょう巻","なっとう巻","たくあん巻"]

sousaku_niku = ["オニオンサーモン","アボカドサーモン","アボカドえび","自家製とろかつお揚げたたきオニオンマヨ","ツナゲットにぎり",
            "肉いなり","まぐろたたきアボカドロール","サーモンアボカドロール","サラダロール","ねぎだくペッパーねぎまぐろ","デミマヨハンバーグ",
            "チャーシューにぎり","和風ハンバーグ","さっぱり蒸し鶏にぎり","牛カルビにぎり"]

kiwami = ["極上大とろ","上煮穴子直火炙り(ハーフ)","上煮穴子天握り(ハーフ)","大切り！真鯛","大切り！真鯛塩直火炙り","ほたて","豚しょうが焼き直火炙り"]

sidemenu = ["厚焼き玉子","たこやき","枝豆","わさびなす盛り","茶碗蒸し","とり唐揚げ","フライドポテト","おつまみ盛り","ツナゲット"]

sirumono_men = ["あおさの味噌汁","貝の味噌汁","まぐろあら汁","かけうどん","えび天うどん","きつねうどん","肉うどん","牛すじうどん",
                "穴子天うどん","ごくっ！旨あっさり醤油ラーメン","ごくっ！旨貝の塩白湯ラーメン","ごくっ！旨鮭出汁の味噌ラーメン"]

sweets = ["いちごのケーキプリンパフェ","チョコのケーキプリンパフェ","プレミアムプリン","プレミアムホイッププリン","プレミアム和風プリン",
            "アーモンドチョコケーキ","プレミアムホワイトケーキ","バニラアイス","チョコアイス","フローズンマンゴー","チーズケーキ",
            "いちごのお手軽ショートケーキ","冷やし白玉ぜんざい"]

syun_tokuneta = ["お子様大好き三貫盛り鮮極鮭いくら掛け","鮮極鮭いくらとあん肝のカップル軍艦","寿司屋の天ぷら海の宝石ディップ",
                "海鮮三宝のプチプチ手巻き","鮮極鮭いくらとあん肝のおろし添え","鮮極鮭いくらのかっぱ茶漬け",
                "七色のいくら手巻き盛り","鮮極鮭いくらの４色SUSHIケーキ","鮮極鮭いくらと海鮮の宝石箱",
                "寒ぶり","寒ぶりはらみ","寒ぶりはらみ直火炙り","本ずわい蟹","広島県産蒸しカキガーリックバターソース直火炙り","広島県産蒸しカキ岩塩直火炙り",
                "広島県産蒸しカキポン酢ジュレのせ","白子ポン酢ジュレのせ","あん肝ポン酢ジュレのせ","あん肝きゅう","あんこうの唐揚げ","寒ぶりのあつめし",
                "炙り白子の茶碗蒸し","寒ぶりのあら汁","神戸牛入り甘辛ごぼうのぶっかけうどん","北海道産小麦のまるごとシフォンケーキ","種子島産安納芋プリン"]

common_nigiri_price = {'鮮極鮭いくら':108,'極上中とろ':108,'まぐろ':108,'びん長まぐろ':108,
                        'とろかつお':108,'サーモン':108,'焼きサーモン':108,'とろサーモン':108,
                        'ノルウェーサーモン':108,'鮮極生えび':108,'えび':108,'甘海老':108,'合盛りえび':108,
                        '赤えび':108,'真いか':108,'やりいか':108,'こういか':108,'いか軟骨':108,'生たこ':108,'たこ':108,
                        'つぶ貝':108,'ほっき貝':108,'赤貝':108,'黒みる貝':108,'熟成かれい':108,
                        '大葉のせえんがわ':108,'煮穴子':108,'〆いわし':108,'とろ〆さば':108,'大あじ':108,'玉子':108,'いなり':108,
                        '合盛り玉子いなり':108,'わさびなす':108,'うなぎ':108,}

aburi_tenpura_price = {'極上中とろ直火炙り':108,'ノルウェーサーモン直火炙り':108,'とろサーモン直火炙り':108,'サーモンチーズマヨ直火炙り':108,
                        '赤えび塩直火炙り':108,'いか軟骨マヨ直火炙り':108,'玉子チーズマヨ直火炙り':108,'えびチーズマヨ直火炙り':108,
                        'ほたて焦がし醤油直火炙り':108,'とろ〆さば直火炙り':108,'えび天にぎり':108,'豪快いか天':108,'えび天巻':108}

gunkan_makimono_price = {'とろねぎ':108,'山かけまぐろ':108,'まぐろたたき':108,'まぐたく':108,'鮭とろっ軍艦':108,'鱒いくら':108,'うに':108,
                        '寿司屋のたたき':108,'海鮮うま辛和え':108,'まぐろそぼろマヨ':108,'いかおくら':108,'なっとう軍艦':108,'合盛りねばねば':108,
                        'かにみそ':108,'甘海老軍艦':108,'サラダ軍艦':108,'コーン':108,'合盛りコーンとサラダ':108,'ツナ':108,
                        'ぱっくり！半熟煮玉子軍艦':108,'ししゃもっこ':108,'かっぱ巻':108,'鉄火巻':108,'干ぴょう巻':108,'なっとう巻':108,'たくあん巻':108}

sousaku_niku_price = {'オニオンサーモン':108,'アボカドサーモン':108,'アボカドえび':108,'自家製とろかつお揚げたたきオニオンマヨ':108,'ツナゲットにぎり':108,
                        '肉いなり':108,'まぐろたたきアボカドロール':108,'サーモンアボカドロール':108,'サラダロール':108,'ねぎだくペッパーねぎまぐろ':108,
                        'デミマヨハンバーグ':108,'チャーシューにぎり':108,'和風ハンバーグ':108,'さっぱり蒸し鶏にぎり':108,'牛カルビにぎり':108}

kiwami_price = {'極上大とろ':194,'上煮穴子直火炙り(ハーフ)':194,'上煮穴子天握り(ハーフ)':194,'大切り！真鯛':194,'大切り！真鯛塩直火炙り':194,'ほたて':194,'豚しょうが焼き直火炙り':194}

sidemenu_price = {'厚焼き玉子':108,'たこやき':108,'枝豆':108,'わさびなす盛り':216,'茶碗蒸し':194,'とり唐揚げ':216,'フライドポテト':216,'おつまみ盛り':216,'ツナゲット':216}

sirumono_men_price = {'あおさの味噌汁':194,'貝の味噌汁':194,'まぐろあら汁':324,'かけうどん':162,'えび天うどん':324,'きつねうどん':324,'肉うどん':324,
                        '牛すじうどん':324,'穴子天うどん':324,'ごくっ！旨あっさり醤油ラーメン':324,'ごくっ！旨貝の塩白湯ラーメン':324,'ごくっ！旨鮭出汁の味噌ラーメン':324}

sweets_price = {'いちごのケーキプリンパフェ':324,'チョコのケーキプリンパフェ':324,'プレミアムプリン':216,'プレミアムホイッププリン':216,'プレミアム和風プリン':216,
            'アーモンドチョコケーキ':216,'プレミアムホワイトケーキ':216,'バニラアイス':108,'チョコアイス':108,'フローズンマンゴー':108,'チーズケーキ':108,
            'いちごのお手軽ショートケーキ':108,'冷やし白玉ぜんざい':108}

syun_tokuneta_price = {'お子様大好き三貫盛り鮮極鮭いくら掛け':216,'鮮極鮭いくらとあん肝のカップル軍艦':194,'寿司屋の天ぷら海の宝石ディップ':518,
                '海鮮三宝のプチプチ手巻き':302,'鮮極鮭いくらとあん肝のおろし添え':324,'鮮極鮭いくらのかっぱ茶漬け':324,
                '七色のいくら手巻き盛り':302,'鮮極鮭いくらの４色SUSHIケーキ':410,'鮮極鮭いくらと海鮮の宝石箱':496,
                '寒ぶり':108,'寒ぶりはらみ':108,'寒ぶりはらみ直火炙り':108,'本ずわい蟹':194,'広島県産蒸しカキガーリックバターソース直火炙り':108,'広島県産蒸しカキ岩塩直火炙り':108,
                '広島県産蒸しカキポン酢ジュレのせ':108,'白子ポン酢ジュレのせ':108,'あん肝ポン酢ジュレのせ':108,'あん肝きゅう':108,'あんこうの唐揚げ':324,'寒ぶりのあつめし':324,
                '炙り白子の茶碗蒸し':194,'寒ぶりのあら汁':324,'神戸牛入り甘辛ごぼうのぶっかけうどん':324,'北海道産小麦のまるごとシフォンケーキ':324,'種子島産安納芋プリン':216}

menu_dict = {1:common_nigiri,2:aburi_tenpura,3:gunkan_makimono,4:sousaku_niku,5:kiwami,6:sidemenu,7:sirumono_men,8:sweets,9:syun_tokuneta}
menuname_dict = {1:'定番にぎり',2:'炙り・天ぷら',3:'軍艦・巻物',4:'創作・肉寿司',5:'極みネタ',6:'一品物',7:'お椀・麺',8:'デザート',9:'旬・特ネタ'}
price_dict = {1:common_nigiri_price,2:aburi_tenpura_price,3:gunkan_makimono_price,
                4:sousaku_niku_price,5:kiwami_price,6:sidemenu_price,
                7:sirumono_men_price,8:sweets_price,9:syun_tokuneta_price}

f = open('data.csv', 'ab')

csv = csv.writer(f)
for i in range(500):
    data = []
    d = datetime.datetime.today()+datetime.timedelta(days=-1)
    timestamp = d.strftime("%Y-%m-%d")
    dict_num = random.randint(1,9)
    category = menu_dict[dict_num]
    category_str = menuname_dict[dict_num]
    item = random.choice(category)
    price_category = price_dict[dict_num]
    price = price_category[item]
    data.append(str(item))
    data.append(str(price))
    data.append(category_str)
    data.append(timestamp)
    csv.writerow(data)

f.close()

